app/controllers/links_controller.rb

INSERT INTO "links" ("created_at", "description", "icon", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 16 Oct 2013 23:14:36 UTC +00:00], ["description", "ad"], ["icon", "asd"], ["title", "asd"], ["updated_at", Wed, 16 Oct 2013 23:14:36 UTC +00:00], ["url", "asd"]]
---
  def create
    @link = Link.new(link_params)

    respond_to do |format|
      if @link.save